# 双模型态度
nc: 12
depth_multiple: 0.33
width_multiple: 0.50
backbone1depth: 5
#边界框的设置
anchors:
#  - [37,50, 29,94, 37,101]
#  - [ 50,84, 39,121, 48,113 ]
#  - [ 61,103, 54,129, 71,126 ]
#  - [ 25,36, 34,88, 69,58 ]
#  - [ 69,129, 143,112, 122,227 ]
#  - [ 269,178, 223,335, 464,361 ]
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

backbone1:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2 #64代表通道数，3表示3*3的卷积核，2代表步长为2,2表示分两组卷积
   #320×320×32
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   #160×160×64
   [-1, 3, C3, [128]],
   #160×160×64
   [ -1, 1, Conv, [256,3,2] ],  # 3-P3/8
    #80×80×128
   [ -1, 6, C3, [256] ],
  ]



backbone2:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  #3
   #320×320×32
   [-1, 1, Conv, [128, 3, 2]],  #
   #160×160×64
   [-1, 3, C3, [128]],
   #160×160×64
    [[-1, 2], 1, Concat3, [128,1]],
    [-1,1,BasicRFB,[128]],
    #160*160*128
    [-1, 6, C3, [256]],
   #160*160*128
   [-1, 1, Conv , [256, 3, 2]],
   #80×80×128
   [-1, 6, C3, [256]], #11
  [[-1, 4], 1, Concat3, [1]],# 12
    [-1,1,BasicRFB,[256]],
   [-1, 6, C3, [256]],#13
   #80×80×128
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/17
   #40×40×256
   [-1, 9, C3, [512]],
   #40×40×256
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   #20×20×512
   [-1, 3, C3, [1024]],
   #20×20×512
   [-1, 1, SPPF, [1024, 5]],  # 20
   #20×20×512
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Bottleneck_DSConv, [512, 1, 1]],
  #20×20×256
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [-1, 1, EVCBlock, [512, 512]],
   #40×40×256
   [[-1, 17], 1, Concat, [1]],  # cat backbone P4
    #40×40×512
   [-1, 3, C3, [512, False]],  # 25
   #40×40×256

   [-1, 1, Bottleneck_DSConv, [256, 1, 1]],
   #40×40×128
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   #80×80×128
   [[-1, 15], 1, Concat, [1]],  # cat backbone P3
   #80×80×256
   [-1, 3, C3, [256, False]],  # 29 (P3/8-small)
   #80×80×128

   [-1, 1, Conv, [256, 3, 2]],
     [-1,1,Bottleneck_DSConv,[256,3]],
   #40×40×256
   [[-1, 26], 1, Concat, [1]],  # cat head P4
   #40×40×512
   [-1, 3, C3, [512, False]],  # 33(P4/16-medium)
   #40×40×256

   [-1, 1, Conv, [512, 3, 2]],
   [-1,1,Bottleneck_DSConv,[512,3]],
   #20×20×256
   [[-1, 21], 1, Concat, [1]],  # cat head P5
   #20×20×1024
   [-1, 3, C3, [1024, False]],  # 37 (P5/32-large)
   #20×20×512

   [[29, 33, 37], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]